; domain
(define (domain miconic)
  (:requirements :strips)
  (:types passenger - object
          floor - object
         )

(:predicates 
(origin ?person - passenger ?floor - floor)
;; entry of ?person is ?floor
;; inertia

(destin ?person - passenger ?floor - floor)
;; exit of ?person is ?floor
;; inertia

(above ?floor1 - floor  ?floor2 - floor)
;; ?floor2 is located above of ?floor1

(boarded ?person - passenger)
;; true if ?person has boarded the lift

;(not_boarded ?person - passenger)
;; true if ?person has not boarded the lift

(served ?person - passenger)
;; true if ?person has alighted as her destination

;(not_served ?person - passenger)
;; true if ?person is not at their destination

(lift_at ?floor - floor)
;; current position of the lift is at ?floor
)


;;stop and allow boarding
(:action board
  :parameters (?floor - floor ?passenger - passenger)
  :precondition (and 
    (lift_at ?floor)
			(origin ?passenger ?floor)
			
  )
  :effect (and 
   (boarded ?passenger)
			
  )
)

;;depart
(:action depart
  :parameters (?floor - floor ?passenger - passenger)
  :precondition (and 
    (lift_at ?floor)
			(boarded ?passenger)
			(destin ?passenger ?floor)
			
  )
  :effect (and 
    (not (boarded ?passenger))
			(served ?passenger)
			
  )
)

;;drive up
(:action up
  :parameters (?floor1 - floor ?floor2 - floor)
  :precondition (and 
    (lift_at ?floor1)
			
  )
  :effect (and 
    (not (lift_at ?floor1))
			(lift_at ?floor2)
			
  )
)

;;drive down
(:action down
  :parameters (?floor1 - floor ?floor2 - floor)
  :precondition (and 
    (above ?floor1 ?floor2)
			(lift_at ?floor1)
			
  )
  :effect (and 
    (not (lift_at ?floor1))
			(lift_at ?floor2)
			
  )
)
)

;; 
;; up action has changed: (above ?floor2 ?floor1), 
;; Last_reduced_capability_num_dropped_pals: None

; problem
(define (problem mixed-f2-p1-u0-v0-g0-a0-n0-A0-B0-N0-F0-r0)
   (:domain miconic)
   (:objects p0 - passenger
             f0 f1 - floor)


(:init
(above f0 f1)



(origin p0 f1)
(destin p0 f0)






(lift_at f0)
)


(:goal (and 
(served p0)
))
)

; plan
1. (down f0 f1)
   deleted: (lift_at f0)
   added: (lift_at f1)
   goals met: 0 of 1
2. (board f1 p0)
   added: (boarded p0)
   goals met: 0 of 1
3. (up f1 f0)
   deleted: (lift_at f1)
   added: (lift_at f0)
   goals met: 0 of 1
4. (depart f0 p0)
   deleted: (boarded p0)
   added: (served p0)
   goals met: 1 of 1
